from flask import Flask, json
import random

list = ["자일로스슈거","설탕","자일로오스","난소화성말토덱스트린","무지방우유","프리마(식물성)","올리고당","식물성경화유지","코코넛오일","농축우유","제이인산칼륨","농축우유단백분말","커피원두","우유","밀가루","밀","초콜릿","설탕","코코아매스","코코아빈","식물성유지","유당","코코아프리퍼레이션","설탕","쇼트닝","팜유","팜올레인유","가공연유","가공버터","전분가공품","맥아엑기스","전지분골드","정제소금","산도조절제3종","기타과당","합성향료2종","효소제","효모","조미오징어","오징어","설탕","가공버터","땅콩버터","정제소금","D-소비톨","L-글루탐산나트륨","구연산","스테비텐소프트","덱스트린","스테비아","호박산이나트륨","메타인산나트륨","글리신","DL-알라닌","D-소비톨액","땅콩","대두","우유","생감자","미강유","팜유","조미염분말","스위트콘","옥수수","설탕","정제소금","양파","샐러드베이스","대두유","대두","난황","발효식초","결정과당","정제소금","설탕","정제수","당근","대두유","홍피망","정제소금","변성전분","잔탄검","달걀"]

api = Flask(__name__)

@api.route('/mock', methods=['GET'])
def get_companies():
    result = ''

    for i in list:
        value = random.random()
        if value > 0.7 :
            result += i + ','
    result = result[:-1]
    return json.dumps(result, ensure_ascii=False)

if __name__ == '__main__':
    api.run(host='0.0.0.0', port=5000)